In [1]:
import sqlite3
conn = sqlite3.connect('test.db')

In [2]:
conn.execute('''
    CREATE TABLE Departments(
      Code INTEGER PRIMARY KEY NOT NULL,
      Name NVARCHAR NOT NULL,
      Budget REAL NOT NULL
    ); '''
)
conn.commit()
print('Departments table created');

Departments table created

In [3]:
conn.execute('''
    CREATE TABLE Employees(
      SSN INTEGER PRIMARY KEY NOT NULL,
      Name TEXT NOT NULL,
      LastName VARCHAR NOT Null,
      Department INTEGER NOT NULL,
      Salary INTEGER NOT NULL,
      CONSTRAINT fk_Departments_Code FOREIGN KEY(Department)
   REFERENCES Department(Code)
    ); '''
)
conn.commit()
print('Employees table created');

Employees table created

In [4]:
conn.execute("INSERT INTO Departments(Code, Name, Budget) VALUES(14, 'IT', 65000);")
conn.execute("INSERT INTO Departments(Code, Name, Budget) VALUES(37, 'Accounting', 15000);")
conn.execute("INSERT INTO Departments(Code, Name, Budget) VALUES(59, 'Human Resources',240000);")
conn.execute("INSERT INTO Departments(Code, Name, Budget) VALUES(77, 'Research', 55000);")

In [5]:
conn.execute("INSERT INTO Employees(SSN, Name, LastName, Department, Salary) VALUES('123234871', 'Michael', 'Scott', 31, 700);")
conn.execute("INSERT INTO Employees(SSN, Name, LastName, Department, Salary) VALUES('123231872', 'Dwight', 'Schrute', 14, 100);")
conn.execute("INSERT INTO Employees(SSN, Name, LastName, Department, Salary) VALUES('143234873', 'Jim', 'Halpert', 56, 400);")
conn.execute("INSERT INTO Employees(SSN, Name, LastName, Department, Salary) VALUES('123244874', 'Pam', 'Beasly', 1, 10);")
conn.execute("INSERT INTO Employees(SSN, Name, LastName, Department, Salary) VALUES('123284875', 'Andy', 'Bernard', 37, 100);")
conn.execute("INSERT INTO Employees(SSN, Name, LastName, Department, Salary) VALUES('183234876', 'Angela', 'Martin', 14, 340);")
conn.execute("INSERT INTO Employees(SSN, Name, LastName, Department, Salary) VALUES('123234877', 'Erin', 'Hannon', 83, 570);")
conn.execute("INSERT INTO Employees(SSN, Name, LastName, Department, Salary) VALUES('123264878', 'Kelly', 'Kapoor', 49, 650);")
conn.execute("INSERT INTO Employees(SSN, Name, LastName, Department, Salary) VALUES('153234878', 'Ryan', 'Howard', 4, 20);")
conn.execute("INSERT INTO Employees(SSN, Name, LastName, Department, Salary) VALUES('123234879', 'Oscar', 'Martinez', 18, 100);")
conn.execute("INSERT INTO Employees(SSN, Name, LastName, Department, Salary) VALUES('123234880', 'Phyllis', 'Vance', 64, 980);")
conn.execute("INSERT INTO Employees(SSN, Name, LastName, Department, Salary) VALUES('173254881', 'Creed', 'Bratton', 7, 100);")
conn.execute("INSERT INTO Employees(SSN, Name, LastName, Department, Salary) VALUES('123234882', 'Stanley', 'Hidson', 14, 740);")
conn.execute("INSERT INTO Employees(SSN, Name, LastName, Department, Salary) VALUES('123224883', 'Toby', 'Flenderson', 12, 450);")
conn.execute("INSERT INTO Employees(SSN, Name, LastName, Department, Salary) VALUES('133234884', 'Meredith', 'Palmer', 14, 500);")
conn.commit()

In [6]:
conn = sqlite3.connect('test.db')
cursor = conn.execute(''' SELECT * FROM Departments''')
for row in cursor:
  print(row)

(14, 'IT', 65000.0)
(37, 'Accounting', 15000.0)
(59, 'Human Resources', 240000.0)
(77, 'Research', 55000.0)

In [7]:
cursor = conn.execute(''' SELECT * FROM Employees''')
for row in cursor:
  print(row)

(123224883, 'Toby', 'Flenderson', 12, 450)
(123231872, 'Dwight', 'Schrute', 14, 100)
(123234871, 'Michael', 'Scott', 31, 700)
(123234877, 'Erin', 'Hannon', 83, 570)
(123234879, 'Oscar', 'Martinez', 18, 100)
(123234880, 'Phyllis', 'Vance', 64, 980)
(123234882, 'Stanley', 'Hidson', 14, 740)
(123244874, 'Pam', 'Beasly', 1, 10)
(123264878, 'Kelly', 'Kapoor', 49, 650)
(123284875, 'Andy', 'Bernard', 37, 100)
(133234884, 'Meredith', 'Palmer', 14, 500)
(143234873, 'Jim', 'Halpert', 56, 400)
(153234878, 'Ryan', 'Howard', 4, 20)
(173254881, 'Creed', 'Bratton', 7, 100)
(183234876, 'Angela', 'Martin', 14, 340)

In [8]:
#Select all the data of employees that work in department 37 or department 14
cursor = conn.execute('''
   SELECT * FROM Employees
   WHERE Department IN(37,14)
''')
for row in cursor:
  print(row)

(123231872, 'Dwight', 'Schrute', 14, 100)
(123234882, 'Stanley', 'Hidson', 14, 740)
(123284875, 'Andy', 'Bernard', 37, 100)
(133234884, 'Meredith', 'Palmer', 14, 500)
(183234876, 'Angela', 'Martin', 14, 340)

In [10]:
#Select the names of the department with more than two employees
#Select all the data of employees that work in department 37 or department 14
cursor = conn.execute('''
   SELECT Name FROM Departments
   WHERE Code IN
   (
    Select Department
    From Employees
    Group BY Department
    HAVING COUNT(*)>2
   );
    ''')
for row in cursor:
  print(row)

('IT',)